Repository: fahmida027/Flutter-growCarrot
Catalog: lib/l10n/app_*.arb
Languages: bn

# appTitle
source: GrowCarrot
bn: গাজর চাষ

# appSubtitle
source: Your Complete Carrot Farming Guide
bn: আপনার সম্পূর্ণ গাজর চাষ গাইড

# splashText
source: From Soil to Harvest...
bn: মাটি থেকে ফসল পর্যন্ত...

# splashWelcome
source: Complete guide to carrot farming - from soil preparation to marketing
bn: গাজর চাষের সম্পূর্ণ গাইড - মাটি প্রস্তুতি থেকে বাজারজাতকরণ পর্যন্ত সব তথ্য

# farmingStages
source: Carrot Farming Stages
bn: গাজর চাষের ধাপসমূহ

# followSteps
source: Follow these steps for successful carrot cultivation
bn: সফল গাজর চাষের জন্য এই ধাপগুলো অনুসরণ করুন

# stageInfo
source: Stage Information
bn: ধাপের তথ্য

source: Quick Tip
bn: দ্রুত টিপস

source: Listen
bn: শুনুন

source: Previous
bn: পূর্ববর্তী

source: Back to Stages
bn: ধাপে ফিরুন

# aboutApp
source: About GrowCarrot
bn: গাজর চাষ সম্পর্কে

# aboutDescription
source: Your complete guide to successful carrot farming from soil preparation to harvest.
bn: মাটি প্রস্তুতি থেকে ফসল তোলা পর্যন্ত সফল গাজর চাষের সম্পূর্ণ গাইড।

source: OK
bn: ঠিক আছে

source: Step
bn: ধাপ

# stage1Name
source: Soil Preparation
bn: মাটি প্রস্তুতি

# stage2Name
source: Seed Selection
bn: বীজ নির্বাচন

# stage3Name
source: Growing Conditions
bn: চাষের পরিবেশ

# stage4Name
source: Irrigation System
bn: সেচ ব্যবস্থা

# stage5Name
source: Pest Control
bn: কীটপতঙ্গ দমন

# stage6Name
source: Plant Care
bn: পরিচর্যা

# stage7Name
source: Growth Stage
bn: বৃদ্ধির পর্যায়

# stage8Name
source: Flowering
bn: ফুল আসা

# stage9Name
source: Ripening Time
bn: পাকার সময়

# stage10Name
source: Harvesting
bn: ফসল তোলা

# stage11Name
source: Marketing
bn: বাজারজাতকরণ

# description1
source: Soil preparation is extremely important for carrot cultivation. First, the land must be well plowed. The soil should be loamy or sandy loam with good drainage. Soil pH should be maintained between 6.0-7.0. Apply 8-10 tons of decomposed cow dung or compost per acre as organic fertilizer. The soil should be cultivated to a depth of 18-20 inches so that carrot roots can easily penetrate deep into the soil.
bn: গাজর চাষের জন্য মাটি প্রস্তুতি অত্যন্ত গুরুত্বপূর্ণ। প্রথমে জমি ভালোভাবে চাষ দিতে হবে। মাটি হতে হবে দোআঁশ বা বেলে দোআঁশ এবং পানি নিকাশের ব্যবস্থা থাকতে হবে। মাটির pH ৬.০-৭.০ এর মধ্যে রাখতে হবে। জৈব সার হিসেবে প্রতি বিঘায় ৮-১০ মণ পচা গোবর বা কম্পোস্ট সার প্রয়োগ করতে হবে। মাটি ১৮-২০ ইঞ্চি গভীর পর্যন্ত চাষ দিতে হবে যাতে গাজরের শিকড় সহজে মাটির গভীরে প্রবেশ করতে পারে।

# description2
source: Selecting good quality seeds is the key to successful carrot cultivation. Both local and foreign varieties of carrot seeds are available. Local varieties include Local Red, while foreign varieties include Kuroda, Nantes. When buying seeds, make sure they are fresh and have a germination capacity of more than 85%. 400-500 grams of seeds are required per acre. Soaking seeds in water for 12 hours before sowing improves germination.
bn: ভালো জাতের বীজ নির্বাচন গাজর চাষের সফলতার মূল চাবিকাঠি। দেশি এবং বিদেশি উভয় জাতের গাজরের বীজ পাওয়া যায়। দেশি জাতের মধ্যে রয়েছে লোকাল রেড, আর বিদেশি জাতের মধ্যে রয়েছে কুরোদা, নান্টেস। বীজ কেনার সময় খেয়াল রাখতে হবে যেন বীজ তাজা হয় এবং অঙ্কুরোদগম ক্ষমতা ৮৫% এর বেশি থাকে। প্রতি বিঘা জমিতে ৪০০-৫০০ গ্রাম বীজের প্রয়োজন হয়। বপনের আগে বীজ ১২ ঘন্টা পানিতে ভিজিয়ে রাখলে অঙ্কুরোদগম ভালো হয়।

# description3
source: Winter is the most suitable time for carrot cultivation. Kartik-Agrahayan months (October-November) are the ideal time for carrot sowing. Temperature should be 15-20 degrees Celsius. Excessive heat or cold hampers carrot growth. Humidity should be maintained at 65-75%. Adequate sunlight is needed so cultivation in shaded areas is not recommended. Care should be taken that rainwater does not accumulate.
bn: গাজর চাষের জন্য শীতকাল সবচেয়ে উপযুক্ত সময়। কার্তিক-অগ্রহায়ণ মাস (অক্টোবর-নভেম্বর) গাজর বপনের আদর্শ সময়। তাপমাত্রা ১৫-২০ ডিগ্রি সেলসিয়াস থাকলে ভালো হয়। অতিরিক্ত গরম বা শীতে গাজরের বৃদ্ধি ব্যাহত হয়। আর্দ্রতা ৬৫-৭৫% রাখতে হবে। পর্যাপ্ত সূর্যের আলো প্রয়োজন তাই ছায়াময় স্থানে চাষ করা যাবে না। বৃষ্টির পানি যেন জমে না থাকে সেদিকে খেয়াল রাখতে হবে।

# description4
source: Regular irrigation is very important in carrot cultivation. Light irrigation should be given after seed sowing so that the soil remains slightly moist at all times. During germination, if the soil dries out, the seeds will not germinate. Irrigation should be given 2-3 times a week. However, excessive water should not be given as it may cause carrot rot. Irrigation should be stopped 10-15 days before harvest to increase sweetness in carrots.
bn: গাজর চাষে নিয়মিত সেচ দেওয়া খুবই গুরুত্বপূর্ণ। বীজ বপনের পর হালকা সেচ দিতে হবে যাতে মাটি সবসময় সামান্য ভেজা থাকে। অঙ্কুরোদগমের সময় মাটি শুকিয়ে গেলে বীজ অঙ্কুরিত হবে না। সপ্তাহে ২-৩ বার সেচ দিতে হবে। তবে অতিরিক্ত পানি দেওয়া যাবে না কারণ এতে গাজর পচে যেতে পারে। ফসল তোলার ১০-১৫ দিন আগে সেচ বন্ধ করতে হবে যাতে গাজরে মিষ্টতা বৃদ্ধি পায়।

# description5
source: Various pests and diseases can attack carrot cultivation. Major pests include aphids, cutworms and green leafhoppers. Diseases include leaf blight, root rot. Neem oil or soap water spray can be used to control pests. Tricho cards or pheromone traps can be used in biological methods. If necessary, approved pesticides should be used but all types of spraying should be stopped at least 15 days before harvest.
bn: গাজর চাষে বিভিন্ন কীটপতঙ্গ ও রোগের আক্রমণ হতে পারে। প্রধান পোকার মধ্যে রয়েছে জাব পোকা, কাটুই পোকা এবং সবুজ পাতা ফড়িং। রোগের মধ্যে রয়েছে পাতা পোড়া রোগ, মূল পচা রোগ। কীটপতঙ্গ দমনের জন্য নিম তেল বা সাবান পানির স্প্রে ব্যবহার করা যেতে পারে। জৈবিক পদ্ধতিতে ট্রাইকো কার্ড বা ফেরোমন ফাঁদ ব্যবহার করা যায়। প্রয়োজনে অনুমোদিত কীটনাশক ব্যবহার করতে হবে তবে ফসল তোলার অন্তত ১৫ দিন আগে সব ধরনের স্প্রে বন্ধ করতে হবে।

# description6
source: For proper carrot care, weeds should be cleaned regularly. First weeding and hoeing should be done 20-25 days after seedling emergence. After that, weeds should be cleaned every 15 days. If the seedlings are too dense, they should be thinned so that there is a distance of 3-4 inches between plants. If the soil becomes hard, it should be loosened with a hoe. Soil should be heaped around the base of carrots to prevent the upper part of carrots from turning green.
bn: গাজরের সঠিক পরিচর্যা করতে হলে নিয়মিত আগাছা পরিষ্কার করতে হবে। চারা গজানোর ২০-২৫ দিন পর প্রথমবার আগাছা পরিষ্কার ও নিড়ানি দিতে হবে। এরপর ১৫ দিন পর পর আগাছা পরিষ্কার করতে হবে। চারা খুব ঘন হলে পাতলা করে দিতে হবে যাতে গাছে গাছে ৩-৪ ইঞ্চি দূরত্ব থাকে। মাটি শক্ত হয়ে গেলে নিড়ানি দিয়ে আলগা করে দিতে হবে। গাজরের গোড়ায় মাটি তুলে দিতে হবে যাতে গাজরের উপরের অংশ সবুজ না হয়ে যায়।

# description7
source: 30-40 days after seed sowing, carrot growth begins rapidly. At this time, the leaves of the plant begin to grow and the roots begin to thicken. Balanced fertilizer should be applied at this stage. 1 kg urea, 2 kg TSP and 1 kg MOP should be applied per acre. Regular irrigation and weed control are extremely important during this growth period. If the leaves of the plant turn yellow, it may be a sign of disease, so be careful.
bn: বীজ বপনের ৩০-৪০ দিন পর গাজরের বৃদ্ধি দ্রুত শুরু হয়। এ সময় গাছের পাতা বড় হতে থাকে এবং শিকড় মোটা হতে শুরু করে। এ পর্যায়ে সুষম সার প্রয়োগ করতে হবে। ইউরিয়া ১ কেজি, টিএসপি ২ কেজি এবং এমওপি ১ কেজি প্রতি বিঘায় প্রয়োগ করতে হবে। বৃদ্ধির এই সময়ে নিয়মিত সেচ এবং আগাছা নিয়ন্ত্রণ অত্যন্ত গুরুত্বপূর্ণ। গাছের পাতা হলুদ হলে তা রোগের লক্ষণ হতে পারে, তাই সতর্ক থাকতে হবে।

# description8
source: Carrots are usually grown for roots, so flowering is undesirable. If for some reason carrot plants flower, it should be cut off. When flowering occurs, carrot roots become hard and bitter and become inedible. Generally, carrots flower when it is too hot or the day length increases. Therefore, sowing seeds at the right time is very important. If cultivated for seed production, flowers should be kept, otherwise all flowers should be cut off.
bn: গাজর সাধারণত শিকড়ের জন্য চাষ করা হয়, তাই ফুল আসা অবাঞ্ছিত। যদি কোনো কারণে গাজর গাছে ফুল আসে তাহলে তা কেটে দিতে হবে। ফুল আসলে গাজরের শিকড় শক্ত এবং তিতা হয়ে যায় এবং খাওয়ার অযোগ্য হয়ে পড়ে। সাধারণত অতিরিক্ত গরম বা দিনের দৈর্ঘ্য বেড়ে গেলে গাজরে ফুল আসে। এজন্য সঠিক সময়ে বীজ বপন করা খুবই গুরুত্বপূর্ণ। যদি বীজ উৎপাদনের জন্য চাষ করা হয় তাহলে ফুল রাখতে হবে, অন্যথায় সব ফুল কেটে দিতে হবে।

# description9
source: Carrots begin to ripen within 85-100 days of seed sowing. The way to recognize ripe carrots is that the upper part of the carrot will be visible above the soil and will turn orange. Ripe carrots will feel firm when pressed by hand. The color of the leaves will become light yellowish. At this time, irrigation should be reduced so that the sweetness of carrots increases. Crops should be harvested at the right time because over-ripening can cause carrots to crack and spoil the taste.
bn: বীজ বপনের ৮৫-১০০ দিনের মধ্যে গাজর পাকতে শুরু করে। পাকা গাজর চেনার উপায় হলো গাজরের উপরের অংশ মাটির উপর দৃশ্যমান হবে এবং কমলা রঙ ধারণ করবে। পাকা গাজর হাত দিয়ে চাপ দিলে শক্ত লাগবে। পাতার রঙ হালকা হলুদাভ হয়ে আসবে। এ সময় সেচ দেওয়া কমিয়ে দিতে হবে যাতে গাজরে মিষ্টতা বৃদ্ধি পায়। সঠিক সময়ে ফসল তুলতে হবে কারণ অতিরিক্ত পাকলে গাজর ফেটে যেতে পারে এবং স্বাদ নষ্ট হয়ে যায়।

# description10
source: The right time to harvest carrots is in the morning or evening when there is less sun. Before harvesting carrots, the soil should be slightly moistened for easy harvesting. Care should be taken not to break the carrots while harvesting. After harvesting, the leaves should be cut immediately and cleaned with clean water to remove soil. Cut or insect-eaten carrots should be separated. Good carrots should be dried in the shade and prepared for storage. 40-50 tons of carrots can be obtained per acre.
bn: গাজর তোলার উপযুক্ত সময় হলো ভোর বেলা বা সন্ধ্যার দিকে যখন রোদ কম থাকে। গাজর তোলার আগে মাটি সামান্য ভিজিয়ে নিলে সহজে তোলা যায়। গাজর তোলার সময় সাবধান থাকতে হবে যেন ভেঙে না যায়। তোলার পর সাথে সাথে পাতা কেটে দিতে হবে এবং পরিষ্কার পানিতে ধুয়ে মাটি পরিষ্কার করতে হবে। কাটা বা পোকায় খাওয়া গাজর আলাদা করতে হবে। ভালো গাজর ছায়ায় শুকিয়ে সংরক্ষণের জন্য প্রস্তুত করতে হবে। প্রতি বিঘায় ৪০-৫০ মণ গাজর পাওয়া যায়।

# description11
source: For carrot marketing, grading should be done first. Large, medium and small carrots should be separated. Good quality carrots should be packed in plastic baskets or cartons. It can be sold in local markets, city markets and wholesale markets. Carrot prices are usually lower in winter and higher in summer. Therefore, storing and selling later results in more profit. Also, carrots can be processed and sold as carrot halwa, pickles, juice etc.
bn: গাজর বাজারজাতকরণের জন্য প্রথমে গ্রেডিং করতে হবে। বড়, মাঝারি এবং ছোট গাজর আলাদা করতে হবে। ভালো মানের গাজর প্লাস্টিকের ঝুড়ি বা কার্টনে প্যাকেট করতে হবে। স্থানীয় বাজার, শহরের বাজার এবং পাইকারি বাজারে বিক্রি করা যায়। গাজরের দাম সাধারণত শীতকালে কম এবং গরমকালে বেশি থাকে। তাই সংরক্ষণ করে রেখে পরে বিক্রি করলে বেশি লাভ হয়। এছাড়া প্রক্রিয়াজাত করে গাজরের হালুয়া, আচার, জুস ইত্যাদি তৈরি করেও বিক্রি করা যায়।

# tip1
source: Test soil pH using a simple soil testing kit available at farm supply stores.
bn: মাটির pH পরীক্ষার জন্য কৃষি সরঞ্জাম দোকান থেকে সাধারণ মাটি পরীক্ষার কিট ব্যবহার করুন।

# tip2
source: Always buy seeds from certified dealers to ensure good germination rates.
bn: ভালো অঙ্কুরোদগমের জন্য সবসময় প্রত্যয়িত বিক্রেতার কাছ থেকে বীজ কিনুন।

# tip3
source: Carrot seeds are tiny - mix them with sand for easier, more even sowing.
bn: গাজরের বীজ খুব ছোট - সমানভাবে বপনের জন্য বালির সাথে মিশিয়ে বুনুন।

# tip4
source: Morning watering is best - it gives plants time to dry before evening.
bn: সকালে পানি দেওয়া উত্তম - এতে সন্ধ্যার আগে গাছ শুকানোর সময় পায়।

# tip5
source: Companion planting with onions or garlic helps naturally repel carrot pests.
bn: পেঁয়াজ বা রসুনের সাথী ফসল হিসেবে চাষ করলে প্রাকৃতিকভাবে পোকা তাড়ায়।

# tip6
source: Thin carrots when young - overcrowded carrots will be small and malformed.
bn: গাজর ছোট থাকতেই পাতলা করুন - ঘন গাজর ছোট ও বিকৃত হয়।

# tip7
source: Green shoulders appearing above soil means your carrots are growing well.
bn: মাটির উপরে সবুজ অংশ দেখা মানে আপনার গাজর ভালো বৃদ্ধি পাচ্ছে।

# tip8
source: Most carrots are harvested for roots, not flowers - flowering reduces root quality.
bn: বেশিরভাগ গাজর শিকড়ের জন্য চাষ করা হয় - ফুল আসলে শিকড়ের গুণমান কমে যায়।

# tip9
source: Gently test carrot size by feeling around the crown without pulling the plant.
bn: গাছ না তুলেই গোড়ার চারপাশে হাত দিয়ে গাজরের আকার পরীক্ষা করুন।

# tip10
source: Harvest on dry days for better storage quality and easier handling.
bn: শুকনো দিনে ফসল তুলুন - এতে সংরক্ষণ ভালো হয় ও কাজ সহজ হয়।

# tip11
source: Clean carrots sell for better prices - invest time in proper post-harvest care.
bn: পরিষ্কার গাজরের দাম ভালো - ফসল তোলার পর যত্নসহকারে পরিষ্কার করুন।
